Hi @emze9 ,
I am not able to reproduce the issue

```
terraform-provider-bigip git:(devel) terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_profile_http.sanjose-http will be created
  + resource "bigip_ltm_profile_http" "sanjose-http" {
      + accept_xff                 = (known after apply)
      + basic_auth_realm           = (known after apply)
      + defaults_from              = "/Common/http"
      + description                = (known after apply)
      + head_erase                 = (known after apply)
      + head_insert                = (known after apply)
      + id                         = (known after apply)
      + insert_xforwarded_for      = (known after apply)
      + lws_separator              = (known after apply)
      + lws_width                  = (known after apply)
      + name                       = "/Common/sanjose-http"
      + oneconnect_transformations = (known after apply)
      + proxy_type                 = (known after apply)
      + redirect_rewrite           = (known after apply)
      + request_chunking           = (known after apply)
      + response_chunking          = (known after apply)
      + response_headers_permitted = (known after apply)
      + server_agent_name          = (known after apply)
      + via_host_name              = (known after apply)
      + via_request                = (known after apply)
      + via_response               = (known after apply)
      + xff_alternative_names      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_profile_http.sanjose-http: Creating...
bigip_ltm_profile_http.sanjose-http: Creation complete after 2s [id=/Common/sanjose-http]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.



terraform-provider-bigip git:(devel) terraform show

# bigip_ltm_profile_http.sanjose-http:
resource "bigip_ltm_profile_http" "sanjose-http" {
    defaults_from              = "/Common/http"
    id                         = "/Common/sanjose-http"
    name                       = "/Common/sanjose-http"
    proxy_type                 = "reverse"
    response_headers_permitted = []
    xff_alternative_names      = []
}
```